import { useMemo, useState } from 'react';

// memo- არის ჩაშენებული დუნქცია რომელიც საშუალებას გვაძლევს, უფრო ოპტიმიზირებული გავხადოთ ჩვენი საიტი, კერძოდ გვეხმარება იმაში რომ, ჩვენ საიტზე არასაჭირო re-render არ მოხდეს ამა თუ იმ კომპონენტის

// useMemo - არის კაუჭი, რომელიც გვეხმარება იმაში რომ, ჩვენს კომპონენტში ავიცილოთ თავიდან სხვადასხვა ტიპის რენდერი

// expensive calculation(ძვირიანი კალკუაცია/ოპერაცია) - ნიშნავს ისეთ ფუნქციას/მოქმედებას რომელსაც სჭირდება დავალების შესასრულებლად დიდი ხანი.


// caching(ქეშირება) - შენახვა ამა თუ ინფორმაციის იქამდე სანამ მისი მნიშვნელობა არ შეიცვლება



function App() {
  const [search, setSearch] = useState("");

  const names = [
    "ლუკა", "ნიკა", "მარიამი", "სოფიო", "გიორგი",
    "ელენე", "დათო", "ნინო", "თამარი", "ანასტასია",
    "ლევანი", "ეკა", "ალექსანდრე", "კახა", "მარი",
    "დიანა", "დავით", "ნანა", "ვახო", "თეონა",
    "ირაკლი", "თათია", "ზურა", "საბა", "ელისო",
    "ანდრო", "ანი", "თორნიკე", "ეკატერინე", "გუგა",
    "ბექა", "ლალი", "შოთი", "ელენე", "ლელა",
    "გიგა", "ლანა", "არჩილი", "ნატო", "გოჩა",
    "თემო", "მარიკა", "გურამი", "მანანა", "ლაშა",
    "სალომე", "ზაზა", "ციცინო", "კესო", "კოტე"
  ];

  const filteredNames = useMemo(() => {
    console.log("Filtering");
    return names.filter((name) =>
      name.toLowerCase().includes(search.toLowerCase())
    );
  }, [search]);

  const handleSubmit = (e) => {
    e.preventDefault();
    setSearch(e.target.firstname.value);
  };

  return (
    <>
      <form onSubmit={handleSubmit}>
        <input type="text" name="firstname" />
        <button>Submit</button>
      </form>
    </>
  );
}

export default App;