import { useState } from 'react'
import ExpensiveCalculator from './components/ExpensiveCalculator'
// 🧠 დავალება: ოპტიმიზაცია useMemo-ით
// შექმენი React კომპონენტი სახელად ExpensiveCalculator, რომელიც:

// აქვს input ველი, სადაც მომხმარებელი შეიტანს რიცხვს.
// რიცხვის ცვლილებისას გამოითვლება ძალიან რთული ფუნქცია (მაგ., რიცხვის უზარმაზარი ფაქტორიალი ან დიდი ციკლი).
// ამ რთული ფუნქციის შედეგი გამოისახება ეკრანზე.
// გვერდით არის სხვა input ველი, რომელიც უბრალოდ ტექსტს იღებს და არ უნდა გამოიწვიოს რთული ფუნქციის თავიდან გამოთვლა.
// გამოიყენე useMemo, რომ რთული გამოთვლა შესრულდეს მხოლოდ მაშინ, როცა რიცხვი იცვლება.

function App() {


  return (
    <>
      <ExpensiveCalculator />
    </>
  )
}

export default App
