// 1) შექმენით 3 განსხვავებული html - ის ფაილი, ჩაწერეთ მათში რაიმე ტექსტები, შექმენით თქვენივე server - ი აამუშავეთ ის  port - 3000 ზე, თქვენი დავალებაა რომ მომხმარებელს random - ულად გამოუტაონოთ html - ის ფაილები, დაგჭირდებათ fs.readFile რომ წაიკითხოთ random html - ის ფაილები


const http = require("http")
const fs = require("fs")

const files = ["./index.html","./login.html","./regiser.html"]
const server = http.createServer((req,res) =>{
    const randomFile = Math.floor(Math.random() * files.length)
    fs.readFile(files[randomFile],(err,data) =>{
        if(err){
            console.log(err)
        }else{
            res.end(data)
        }
    })
})

server.listen(3000,()=>{
    console.log("server is running")
})


// კომენტარების სახით ახსენით თუ ზოგდად რა არის server - ი, ასევე ახსენით თუ რა არის request (მოთხოვნა), response (პასუხი), რაში ვიყენებთ http module - ს, რას ნიშნავს res.end() 


// სერვერი არის მოწყობილობა ან პროგრამა, რომელიც ამუშავებს მოთხოვნებს და აწვდის რესურსებს, მონაცემებს ან სერვისებს სხვა კომპიუტერებს, რომელსაც ვუწოდებთ კლიენტებს

// მაგალითად:

// კლიენტი — ითხოვს რაღაცას (მაგ. ვებ-გვერდს).

// სერვერი — პასუხობს ამ მოთხოვნაზე და აგზავნის შედეგს (მაგ. HTML ფაილს, სურათს, მონაცემებს).


// request(მოთხოვნა) -> ხდება მაშინ როცა მომხმარებელი ითხოვს რაღაც კონკრეტულ მონაცემს , ამ მოთხოვნის შედეგად დაბრუნებულ პასუხს კი ეწოდება response(პასუხი), მომხმარებელს შეიძლება დაუბრუნდეს ფაილი სურათი ან მსგავსი მონაცემი. დამოკიდებულია იმაზე თუ რას ითხოვს ის

// http მოდულს ვიყენებთ იმისთვის რომ კონკრეტულ პორტზე მოხდეს სერვერის გაშვება და მოხდეს ურთიერთობა კლიენტსა და სერვერს შორის, ასევე გაკონტროლდეს მოთხოვნა/პასუხის მუშაობა.

// res.end -> არის საბოლოო პასუხი იმისა რასაც მოითხოვს მომხმარებელი