//  გამოიყანეთ buffer მოდული იმსათვის რ0ომ შექმნატ ხელოვნურად რაღაცა მეხსიერება 10 ადგილით და შეავსეთ ეგ მასივი სიმბოლოებით, შემდეგ კი გამოიყენეთ toString მეთოდი რომ რეალურ სტრინგად გარდაქმნათ, აგრეტვე გამოიყენეთ buffer მოდულის from მეთოდი იმსიასათვის რომ გაიგო კონკრეტულ სტრინგიში ყველა სიმბიოლოს კოდი (კომენტარებით ახსენით რა არის buffer და რა არიოს ორობითი  binaryმონაცემი)



const bufferAlloc = Buffer.alloc(10,"ab")

const bufferStr = bufferAlloc.toString()



console.log(Buffer.from(bufferStr))


// Buffer მოდული node ში, ობიექტია რომელიც გამოიყენება ბინარული მონაცემების სამართავად.


// ბინარულია მონაცემი,რომელიც პირდაპირ ბაიტებად ინახება და არა როგორც ჩვეულებრივი ტექსტი ან ჯავასკრიპტის ობიექტი.