import { useState } from 'react'
import Form from './components/Form'

// 2) შექმენით input რომელშიც მომხამრებელმა უნდა შეიტანოს ტექსტი, უნდა გქონდეთ ღილაკი Light/Dark — როდესაც მომხმარებელი დააჭერს ღილაკს უნდა შეიცვალოს უკანა ფონი და უნდა შეიცვალოს ღილაკში არსებული ტექსტი theme - ის მიხედვით, გამოიყენეთ useState text - ისთვის და isDarkMode - ისთვის, გამოიყენეთ ერთი useMemo ჰუკი, რომელიც ითვლის ტექსტის სიგრძეს და აბრუნებს შედეგს, თუ ტექსტი 20-ზე ნაკლები სიმბოლოსგან შედგება გამოიტანეთ Short text, თუ ტექსტი 20–50 სიმბოლოსგან შედგება Medium text, თუ 50 ზე მეტი სიმბოლოსგან შედგება - Long text, ეს უნდა დაიმახსოვროს useMemo - მ მხოლოდ მაშინ, როცა text შეიცვლება
// თემის შეცვლამ არ უნდა გამოიწვიოს ხელახალი დარენდერება, გამოიტანეთ ეკრანზე ტექსტის სიმბოლოების დათვლის შედეგი,
// theme: light/dark
function App() {

  return (
    <>
      <Form />
      
    </>
  )
}

export default App
