//  თქვენი დავალებაა მხოლოდ იმ შემთხვევაში დაბეჭდოს morgan მა ინფორმაცია როდესაც ჯერ კიდევ მუშაობის პროცესში ხართ, ამისათვის დაგჭირდებათ .env ფაილი (კომენტარებით ახსენით, რაში გამოიყენება ის, როგორ უნდა გამოვიყენოთ express გარემოს ცვლადები, რატომ გვიწევს dotenv მოდულის გადმოწერა), როდესაც ფაილს დაამატებთ მასში შექმენით ორი ცვლადი NODE_ENV და PORT, NODE_ENV შეინახეთ development ან production, შემდეგ მისი მნიშვნელობის მიხედვით გადაწყვიტეთ უნდა დაბეჭდოს თუ არა მორგანმა მოთხოვბნის შესახებ ინფორმაცია, აგრეთვე listen მეთოდს გადაეცით მნიშვნელობა env ფაილის გამოყენებით + გამოიყენეთ .gitignore ფაილი (ახსენით კომენტარებით მისი დანიშნულება) იმისათვის რომ დააგნიოროს გითმა .env და node_modules ფაილი/ფოლდერი



// .env არის ფაილი რომელიც გამოიყენება სამუშაო გარემოში მყოფი ცვლადების შესანახად

// მაგ:NODE_ENV - რომელ გარემოში ვმუშაობთ (development ან production)

// Port - სერვერის გამშვები პორტი


// .env -  არ უნდა მოხვდეს Git ში, რადგან შეიძლება შეიცავდეს ანონიმურ ინფორმაციას მაგ:პაროლი და სხვა.ამიტომ ეს ფაილი უნდა ჩავამატოთ gitignore ფაილში



// Node.js თვითონ ვერ კითხულობს .env ფაილს.
// dotenv მოდული საშუალებას გვაძლევს .env-ის ცვლადები ჩავტვირთოთ process.env-ში, რომლებსაც შემდეგ ყველგან გამოვიყენებთ.


const express = require("express")

const morgan = require("morgan")
const dotenv = require("dotenv")
dotenv.config()

const app = express()


if(process.env.NODE_ENV === "development"){
    app.use(morgan("dev"))
}

app.get("/",(req,res) =>{
    res.send("Hello")
})


const PORT = process.env.PORT
app.listen(PORT,() =>{
    console.log("Server is running")
})