// 1) შემქნეით მ,ასივი და ობიექტი, გამოიყენეთ console table მეთოდი რომ ცხრილის სახით გამოიტანოთ ორივე მონაცემი (აუცილებლად ახსენით კომენტრაებით რა არის მოდული, მოდულარობა, ჩაშენებული მოდულები, გარე მოდულები და გლობალური მოდულები)



// მოდული არის რაღაც კონკრეტული კოდის ბლოკი , რომელიც გარკვეულ დავალებას ასრულებს და მისი გამოყენება შეიძლება სხვა ფაილებში

//მოდულარობა შეიძლება ითქვას, რომ არის პროცესი, როდესაც პროექტი სხვადასხვა მოდულად. რომლებიც რაღაც გარკვეულ დავალებებს ასრულებენ


// ჩაშენებულია მოდულები,რომლებიც უკვე ჩაშენებულია ჩვენს პროგრამირების ენაში და ვიყენებთ მათ და მის კუთვნილებებს ინსტალაციის გარეშე.

// გარე მოდულები არის ისეთი მოდულები რომლებსაც, სჭირება ინსტალაცია და იმპორტი რომ შევასრულოთ მისი დახმარებით რაღაც კონკრეტული დავალება



// const names = ["Giorgi","Luka","Goga","Vano"]

// console.table(names)

// const person = {
//     name:"Giorgi",
//     age:18
// }

// console.table(person)




// process — გვეხმარება პროცესთან დაკავშირებულ ინფორმაციაზე წვდომაში
// process.argv — ეს არის მასივი, რომელიც ინახავს ტერმინალში ჩაწერილ არგუმენტებს



const args = process.argv.slice(2)


const num1 = parseInt(args[0])
const num2 = parseInt(args[1])


const sum = num1 + num2;
console.log(`The sum is: ${sum}`)

const convertToMb = (bytes) => (bytes / 1024 / 1024).toFixed(2);


console.log(convertToMb(process.memoryUsage().heapUsed));
